# -*- coding utf-8 -*-
# @ProjectName: py_zichen
# @Script: ProcessAndObject
# @Discription: 面向过程和面向对象
# @Author: 子辰
# @Date: 2020-09-06 02:20
# @Software: PyCharm
""" 面向过程和面向对象 """
"""
面向过程：
面向过程，核心就是过程二字。面向过程设计思维就好比精心设计好的一条流水线，考虑周全，相应时候处理相应问题
优点：将复杂的问题流程化，进而简单化
缺点：扩展性差，（如更改需求，可能整个代码都需要重写，牵一发而动全身）
"""
'''
面向对象：
面向对象，是对现实世界的模拟。
面向对象的编程特点：
    1. 可以编写表示真是世界中的事物和情景的类，并基于这些来创建对象
    2. 可以使用程序的维护和扩展变得简单，并且可以大大提高程序开发效率
面向对象三大特点：
    1. 封装性
    2. 继承性
    3. 多态性
1. 封装性： 将对象的特征与行为保存起来
2. 继承性： 通过继承，子类可快速获取父类的特征与行为
3. 多态性： 不同子类对象，调用相同的父类方法，产生不同的执行结果
'''
